`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2019/03/21 19:15:48
// Design Name: 
// Module Name: ALU_test
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


module ALU_test();
    reg [5:0] a,b;
    reg [2:0] s;
    wire [5:0] y;
    wire f;
    ALU LUT (
        .a(a),
        .b(b),
        .s(s),
        .y(y),
        .f(f)
    );
    initial
    begin
        /*0空运算*/
            s=3'b0000;a=6'b000000; b=6'b000001;#50;
            s=3'b0000;a=6'b000001; b=6'b000001;#50;
        /*1算术加运算*/
            s=3'b0001;a=6'b011111; b=6'b011111;#50;
            s=3'b0001;a=6'b111111; b=6'b111111;#50;
        /*2算术减运算*/
            s=3'b0010;a=6'b011111; b=6'b011110;#50;
            s=3'b0010;a=6'b011111; b=6'b111111;#50;
        /*3按位与*/
            s=3'b0011;a=6'b000000; b=6'b000001;#50;
            s=3'b0011;a=6'b000001; b=6'b000001;#50;
        /*4按位或*/
            s=3'b0100;a=6'b000000; b=6'b000001;#50;
            s=3'b0100;a=6'b000000; b=6'b000000;#50;
        /*5按位异或*/
            s=3'b0101;a=6'b000000; b=6'b000001;#50;
            s=3'b0101;a=6'b000000; b=6'b000000;#50;
        /*6按位或非*/
            s=3'b0110;a=6'b000000; b=6'b000001;#50;
            s=3'b0110;a=6'b000000; b=6'b000000;#50;
        /*7a>b时,输出1，否则输出0*/
            s=3'b0111;a=6'b011111; b=6'b100111;#50;
            s=3'b0111;a=6'b111111; b=6'b011111;#50;
    end
    
endmodule
